// // Задача №17. Напишите программу, которая принимает на вход координаты точки (X и Y), 
// // причем X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка.

// Console.WriteLine("Введите число");
// int X = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите число");
// int Y = Convert.ToInt32(Console.ReadLine());

// if(X>0 && Y>0)
// {
//     Console.WriteLine("1");
// }
// else if(X<0 && Y>0)
// {
//      Console.WriteLine("2");
// }
// else if(X<0 && Y<0)
// {
//      Console.WriteLine("3");
// }
// else
// {
//     Console.WriteLine("4");
// }



// Напишите программу, которая по заданному номеру четверти, показывает
//  диапазон возможных координат
// //  точек в этой четверти (x и y).

// Console.WriteLine("Введите число");
// int num = Convert.ToInt32(Console.ReadLine());

// if(num==1)
// {
//     Console.WriteLine("X>0 и Y >0");
// }
// else if(num==2)
// {
//      Console.WriteLine("X<0 && Y>0");
// }
// else if(num==3)
// {
//      Console.WriteLine("X<0 && Y<0");
// }
// else if(num==4)
// {
//     Console.WriteLine("X>0 && Y<0");
// }
// else
// {
//      Console.WriteLine("Нет такой четверти");
// }



//Напишите программу, которая принимает на вход координаты двух точек
//и находит расстояние между ними в 2D пространстве.

// int n =49;
 
// double result= Math.Sqrt(48);
// System.Console.WriteLine(result);